export const QA023 = [
  ["시스템에 구현된 UI를 일반 사용자가 사용하면서 문제점이나 개선점을 도출해 내는 방식의 테스트", "사용성 테스트", "Usability Test"],
  ["UI의 만족도나 완성도, 효율성 등을 확인하고 향상시키기 위해 수행하며, 사용자가 접근하고 이용하는 측면에서 선호할 만한 기능을 테스트하는 것", "사용성 테스트", "Usability Test"],
  ["요구사항의 반영 여부를 점검하고, 이 테스트 과정에서 발생한 새로운 요구사항은 소프트웨어 구현 과정에서 반영함", "사용성 테스트", "Usability Test"],
  ["사용자와 컴퓨터 사이에 발생하는 어떠한 행위에 대하여 사용자가 정확하게 이해하고 사용하며, 향후 다시 사용하고 싶은 정도를 나타냄", "사용성", "Usability"],
  ["사용성 테스트 기법 중 구현 전에 소규모로 시험 작동해 보거나, 모의로 시행해 보는 기법", "파일럿 테스트", "Pilot Test"],
  ["사용성 테스트 기법 중 초심자와 대상 제품의 설계 및 개발에 참여한 숙련자를 테스트에 참여시킨 후 수행시간을 비교하여 문제점을 찾는 기법", "NEM 기법", "Novice Expert ratio Method"],
  ["사용성 테스트 기법 중 테스트에 참여한 사용자와 일대일 면접을 통해 심리를 파악하는 기법으로, 조사원의 숙련도에 따라 결과의 신뢰성과 타당성이 변할 수 있음", "심층 인터뷰", "In Depth Interview"],
  ["사용성 테스트 기법 중 제품 사용이 예상되는 사용자를 6~12명 정도 선발하여 면접자의 진행 아래 조사 목적과 관련된 토론을 통해 의견을 수집하는 기법", "포커스 그룹 인터넷", "FGI", "Focus Group Interview"],
  ["사용성 테스트 기법 중 제품의 사용 과정 가운데 특정 상황이나 맥락을 정한 후 사용자가 해당 환경에서 사용하는 동안 인터뷰를 진행하면서 의견을 수집하는 기법", "맥락적 인터뷰", "Contextual Inquiry/Interviews"],
  ["사용성 테스트의 결과 데이터들을 취합하고 분석하여 문서화한 것으로, 분석된 데이터는 가이드 자료로 활용하거나, UI의 수정/보완 등의 향후 적용 계획에 반영함", "사용성 평가 분석서"],
  ["사용성 평가 분석서에 사용되는 분석 기법 중 테스트 수행 중에 사용자가 범한 실수를 수집하여 분석하는 기법", "에러 매트릭스"],
  ["사용성 평가 분석서에 사용되는 분석 기법 중 테스트 수행 시간, 테스트의 완료까지 사용자가 수행한 행동의 개수, 테스트 성공률 등을 분석하는 기법", "효율성 매트릭스"],
  ["사용성 평가 분석서에 사용되는 분석 기법 중 테스트의 각 구간 마다 수행 시간을 기록하여 분석하는 기법", "시간 기반 태스크 매트릭스"]
];