export const QA025 = [
  ["사용성 및 UI 테스트를 통해 도출된 결과에 대해 개선 방안을 마련하고 이를 토대로 수정 계획을 수립하여 수행한 후 작성된 결과 보고서를 관련 부서와 공유하기까지의 과정을 의미", "UI 테스트 결과 보고"],
  ["UI 테스트 결과 보고 프로세스 중 사용성 및 UI 테스트를 통해 도출된 결과를 대상으로 개선이 필요한 항목을 선정하는 단계", "UI 개선 방안 및 수정 계획 수립"],
  ["UI 테스트 결과 보고 프로세스 중 하나의 개선 항목을 개선할 경우 다른 항목에 미치는 영향의 상관관계를 분석하여 개선 방안을 반영하는 단계", "UI 개산 방안 및 수정 계획 수립"],
  ["UI 테스트 결과 보고 프로세스 중 UI 개선 방안 및 수정 계획 수립 과정에서 수립된 개선 방안 및 수정 계획을 바탕으로 UI를 개선하는 단계", "UI 개선 및 수정 수행"],
  ["UI 테스트 결과 보고 프로세스 중 개선된 UI는 ISO/IEC 9126 등의 표준을 활용하여 품질을 측정하며 사용자의 반응 확인을 위해 정량적, 정상적 리서치를 수행하고, 겨로가 보고서를 작성하여 관련 부서에 공유하는 단계", "UI 개선 결과 보고서 작성 및 공유"],
  ["UI 테스트 결과 보고 프로세스 순서 : (     ) → UI 개선 및 수정 수행 → UI 개선 겨로가 보고서 작성 및 공유", "UI 개선 방안 및 수정 계획 수립"],
  ["UI 테스트 결과 보고 프로세스 순서 : UI 개선 방안 및 수정 계획 수립 → (     ) → UI 개선 겨로가 보고서 작성 및 공유", "UI 개선 및 수정 수행"],
  ["UI 테스트 결과 보고 프로세스 순서 : UI 개선 방안 및 수정 계획 수립 → UI 개선 및 수정 수행 → (     )", "UI 개선 겨로가 보고서 작성 및 공유"]
];