export const QA024 = [
  ["구현된 UI의 사용성을 검증하기 위해 테스트를 수행하고, 결과에 따라 개선 및 결과 보고서를 작성하는 행위 또는 그 절차를 의미", "UI 테스트"],
  ["사용자가 미리 작성된 시나리오에 따라 직접 제품을 사용하면서 진행하는 사용자 중심의 테스트로, 사용자의 요구사항과 행동을 관찰할 수 있는 유용한 진단 방법", "UI 테스트"],
  ["UI 테스트 기법의 종류 중 최소 3명 이상의 디자인 전문가가 사전에 작성한 원칙에 따라 제품을 평가하는 기법", "휴리스틱 평가", "Heuristic Evaluation"],
  ["UI 테스트 기법의 종류 중 UI의 구현 정도에 관계없이 평가가 가능하며 전문가의 능력에 따라 평가 시간이나 수준이 달라짐", "휴리스틱 평가", "Heuristic Evaluation"],
  ["종이로 해당 서비스를 간단하게 만들어 실제 구현되는 것처럼 표현하고, 이를 이용하여 테스트하는 평가 방법", "페이퍼 프로토타입", "Paper Prototype"],
  ["UI 테스트 기법의 종류 중 프로토타입 작성 시 포함되어야 할 중요한 내용을 체크리스트로 작성하고, 테스트 기법 중 가장 빠른 방법으로 제품의 전반적인 컨셉과 흐름을 보여줌", "페이퍼 프로토타입", "Paper Prototype"],
  ["UI 테스트 기법의 종류 중 'A보다 B가 더 좋다'와 같이 선호도에 영향을 주는 속성들을 파악하고 예측하기 위한 기법으로 사용자의 감성을 분석하기 위해 과학적인 시점에서 객관적으로 해석해야 함", "선호도 평가", "Preference Evaluation"],
  ["UI 테스트 기법의 종류 중 개발의 마지막 단계에서 제품의 학습성, 효율성, 기억용이성, 오류, 만족도 등을 평가한 결과를 바탕으로 성능을 개선하는 기법", "성능 평가", "Performance Evaluation"],
  ["UI 테스트 기법의 성능 평가(Performance Evaluation) 중 쉽게 배울 수 있는가를 파악하는 평가", "학습성"],
  ["UI 테스트 기법의 성능 평가(Performance Evaluation) 중 이용에 필요 이상의 노력이 필요하지는 않는가를 파악하는 평가", "율성"],
  ["UI 테스트 기법의 성능 평가(Performance Evaluation) 중 사용했던 기능을 다시 사용하는데 어렵지는 않은가를 파악하는 평가", "기억용이성"],
  ["UI 테스트 기법의 성능 평가(Performance Evaluation) 중 오류가 발생하거나, 발생했을 때 극복이 가능한가를 파악하는 평가", "오류"],
  ["UI 테스트 기법의 성능 평가(Performance Evaluation) 중 사용에 불만족스러운 부분은 없었는가를 파악하는 평가", "만족도"],
  ["UI 테스트 기법의 종류 중 추상적인 컨셉들과 그 사이의 관계를 간편하게 시각화하여 표현하는 모형으로 UI 컨셉션과 GUI 컨셉션 두 종류가 있음", "컨셉 모델", "Concept Model"], 
  ["UI 테스트 기법의 컨셉 모델(Concept Model) 중 주요 화면에 대한 컨셉 모델", "UI 컨셉션", "UI Conception"],
  ["UI 테스트 기법의 컨셉 모델(Concept Model) 중 UX에 대한 컨셉 모델로, 주요 화면에 대한 시안을 디자인 하거나 컨셉 보드를 제작하는 컨셉 모델", "GUI 컨셉션", "GUI Conception"]
  ["UI 테스트 기법의 종류 중 사람들의 행동 동기와 사고 과정을 표현한 후 의미상 가까운 것끼리 모은 다음 행동들의 패턴을 찾아 정의하는 모형", "멘탈 모델", "Mental Model"],
  ["UI 테스트 기법의 종류 중 아이디어와 컨셉을 카드에 적은 후 분류 및 정렬하여 그룹화시킴으로써 정보를 구조화하는 방법", "카드 소팅", "Card Sorting"]
];