export const QA022 = [
  ["사용자와 시스템 간의 상호작용을 원활하게 이루어지도록 도와주는 장치나 소프트웨어", "사용자 인터페이스", "UI", "User Interface"],
  ["정보 제공과 전달을 위한 물리적 제어에 관한 분야, 콘텐츠의 상세적인 표현과 전체적인 구성에 관한 분야, 모든 사용자가 편리하고 간편하게 사용하도록 기능에 관한 분야. 이 세 가지 분야는 어느 것에 대한 설명인가", "사용자 인터페이스", "UI", "User Interface"],
  ["사용자 인터페이스의 구분 중 명령과 출력이 텍스트 형태로 이뤄지는 인터페이스", "CLI", "Command Line Interface"],
  ["사용자 인터페이스의 구분 중 아이콘이나 메뉴를 마우스로 선택하여 작업을 수행하는 그래픽 환경의 인터페이스", "GUI", "Graphical User Interface"],
  ["사용자 인터페이스의 구분 중 사용자의 말이나 행동으로 기기를 조작하는 인터페이스", "NUI", "Natural User Interface"],
  ["사용자 인터페이스의 기본 원칙 중 누구나 쉽게 이해하고 사용할 수 있어야 한다는 원칙", "직관성"],
  ["사용자 인터페이스의 기본 원칙 중 사용자의 목적을 정확하고 완벽하게 달성할 수 있어야 한다는 원칙", "유효성"],
  ["사용자 인터페이스의 기본 원칙 중 누구나 쉽게 배우고 익힐 수 있어야 한다는 원칙", "학습성"],
  ["사용자 인터페이스의 기본 원칙 중 사용자의 요구사항을 최대한 수용하고 실수를 최소화해야 한다는 원칙", "유연성"]
]