export const QA056 = [
  ["소프트웨어가 사용자의 요구사항을 정확하게 준수했는지를 확인하기 위한 테스트 항목에 대한 명세서로 이것을 이용하지 않은 테스트는 특정 요소에 대한 검증이 누락되거나 불필요한 검증의 반복으로 인해 인력과 시간을 낭비할 수 있음", "테스트 케이스", "Test Case"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 항목 식별자, 일련번호에 해당하는 것", "식별자", "Identifier"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 테스트 대상(모듈 또는 기능)에 해당하는 것", "테스트 항목", "Test Item"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 입력 데이터 또는 테스트 조건에 해당하는 것", "입력 명세", "Input Specification"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 테스트 케이스 수행 시 예상되는 출력 결과", "출력 명세", "Output Specification"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 필요한 하드웨어나 소프트웨어의 환경", "환경 설정", "Environmental Needs"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 테스트 케이스 수행 시 특별히 요구되는 절차", "특수 절차 요구", "Special Procedure Requirement"],
  ["ISO/IEC/IEEE 29119-3 표준에 따른 테스트 케이스의 구성 요소 중 테스트 케이스 간의 의존성", "의존성 기술", "Inter-case Dependencies"],
  ["테스트 케이스를 적용하는 순서에 따라 여러 개의 테스트 케이스를 묶은 집합으로 테스트 케이스를 적용하는 구체적인 절차를 명세하고, 테스트 순서에 대한 구체적인 절차, 사전 조건, 입력 데이터 등이 설정되어 있음", "테스트 시나리오", "Test Scenario"],
  ["테스트 결과가 올바른지 판단하기 위해 사전에 정의된 참 값을 대입하여 비교하는 기법 및 활동을 말하며 결과를 판단하기 위해 테스트 케이스에 대한 예상 결과를 계산하거나 확인함", "테스트 오라클", "Test Oracle"],
  ["테스트 오라클의 특징 중 테스트 오라클을 모든 테스트 케이스에 적용할 수 없다는 특징", "제한된 검증"],
  ["테스트 오라클의 특징 중 테스트 오라클의 값을 수학적 기법을 이용하여 구할 수 있다는 특징", "수학적 기법"],
  ["테스트 오라클의 특징 중 테스트 대상 프로그램의 실행, 결과 비교, 커버리지 측정 등을 자동화 할 수 있다는 특징", "자동화 기능"],
  ["테스트 오라클의 종류 중 모든 테스트 케이스의 입력 값에 대해 기대하는 결과를 제공하는 오라클로, 발생된 모든 오류를 검출할 수 있는 오라클", "참 오라클", "True Oracle"],
  ["테스트 오라클의 종류 중 특정한 몇몇 테스트 케이스의 입력 값들에 대해서만 기대하는 결과를 제공하는 오라클로 전수 테스트가 불가능한 경우 사용하는 오라클", "샘플링 오라클", "Sampling Oracle"],
  ["테스트 오라클의 종류 중 특정 테스트 케이스의 입력 값에 대해 기대하는 결과를 제공하고, 나머지 입력 값들에 대해서는 추정으로 처리하는 오라클", "추정 오라클", "Heuristic Oracle"],
  ["테스트 오라클의 종류 중 애플리케이션에 변경이 있을 때, 테스트 케이스의 수행 전과 후의 결과 값이 동일한지를 확인하는 오라클", "일관성 검사 오라클", "Consistent Oracle"]
];