export const QA017 = [
  ["웹 애플리케이션의 로직을 구현할 서버 프로그램을 제작하여 웹 애플리케이션 서버(WAS)에 탑재하는 것", "서버 개발"],
  ["사전적으로 '뼈대', '골조'를 의미하는데, 소프트웨어에서는 특정 기능을 수행하는 데 필요한 클래스나 인터페이스 등을 모아둔 집합체를 말하며 각 프로그래밍 언어에는 해당 언어로 서버 프로그램을 개발할 수 있도록 지원하는 소프트웨어", "프레임워크", "Framework"],
  ["서버 프로그램 개발 시 다양한 네트워크 설정, 요청 및 응답 처리, 아키텍처 모델 구현 등을 손쉽게 처리할 수 있도록 클래스나 인터페이스를 제공하는 소프트웨어", "서버 개발 프레임워크"],
  ["시스템을 세 부분으로 분리하여 서로 영향받지 않고 개발할 수 있는 아키텍처 패턴을 의미하며 서버 개발 프레임워크의 대부분의 기반 된 패턴", "모델-뷰-컨트롤러 패턴", "MVC 패턴"],
  ["JAVA를 기반으로 만들어진 프레임워크로, 전자정부 표준 프레임워크의 기반 기술로 사용되고 있는 서버 개발 프레임워크", "Spring", "스프링"],
  ["JavaScript를 기반으로 만든 프레임워크로, 비동기 입/출력 처리와 이벤트 위주의 높은 처리 성능을 갖고 있어 실시간으로 입/출력이 빈번한 애플리케이션에 적합한 서버 개발 프레임워크", "Node.js"],
  ["Python을 기반으로 만든 프레임워크로, 컴포넌트의 재사용과 플러그인화를 강조하여 신속한 개발이 가능하도록 지원하는 서버 개발 프레임워크", "Django", "장고"],
  ["PHP를 기반으로 만든 프레임워크로, 인터페이스가 간편하며 서버 자원을 적게 사용하는 서버 개발 프레임워크", "Condeigniter", "코드이그나이터"],
  ["Ruby를 기반으로 만든 프레임워크로, 테스트를 위한 웹 서버를 지원하며 데이터베이스 작업을 단순화, 자동화시켜 개발 코드의 길이가 짧아지게 함으로써 신속한 개발이 가능한 서버 개발 프레임워크", "Ruby on Rails"],
  ["DTO/VO, SQL,  DAO, Service, Controller를 각각 구현하는 과정", "서버 개발 과정"],
  ["데이터 교환을 위해 사용할 객체를 만드는 과정으로 송/수신할 데이터의 자료형(Data Type)에 맞는 변수 및 객체를 생성하는 과정", "DTO/VO 구현"],
  ["데이터의 삽입, 변경, 삭제 등의 작업을 수행할 SQL문을 생성하는 과정으로 SQL문은 소스 코드 내에 직접 입력 또는 별도의 XML 파일로 관리하는 과정", "SQL 구현"],
  ["데이터베이스에 접근하고, SQL을 활용하여 데이터를 실제로 조작하는 코드를 구현하는 과정", "DAO 구현"],
  ["데이터베이스에 접근하여 데이터를 조회, 생성, 수정, 삭제 작업을 수행하는 객체를 의미", "DAO", "Data Access Object"],
  ["사용자의 요청에 응답하기 위한 로직을 구현하는 과정", "Service 구현"],
  ["사용자의 요청에 적절한 서비스를 호출하여, 그 결과를 사용자에게 반환하는 코드를 구현하는 과정", "Controller 구현"]
];